export interface Poet {
  id: number
  name: string
}

export interface Poem {
  id: number
  couplets: string[]
  poetId: number
}

export const poets: Poet[] = [
  // COMMENT USED TO PREVENT `biome` wrapping this line...
  { id: 0, name: "حافظ" },
]

export const poems: Poem[] = [
  {
    id: 0,
    couplets: [
      "جز نقش تو در نظر نیامد ما را",
      "جز کوی تو رهگذر نیامد ما را",
      "خواب ار چه خوش آمد همه را در عهدت",
      "حقّا که به چشم دَر نیامد ما را",
    ],
    poetId: 0,
  },
  {
    id: 1,
    couplets: [
      "بر گیر شراب طرب‌انگیز و بیا",
      "پنهان ز رقیب سفله بستیز و بیا",
      "مشنو سخن خصم که بنشین و مرو",
      "بشنو ز من این نکته که برخیز و بیا",
    ],
    poetId: 0,
  },
  {
    id: 2,
    couplets: [
      "گفتم که لبت، گفت لبم آب حیات",
      "گفتم دهنت، گفت زهی حبّ نبات",
      "گفتم سخن تو، گفت حافظ گفتا",
      "شادیِ همه لطیفه‌گویان صلوات",
    ],
    poetId: 0,
  },
  {
    id: 3,
    couplets: [
      "ماهی که قدش به سرو می‌ماند راست",
      "آیینه به دست و روی خود می‌آراست",
      "دستارچه‌ای پیشکشش کردم، گفت",
      "وصلم طلبی زهی خیالی که تو راست",
    ],
    poetId: 0,
  },
  {
    id: 4,
    couplets: [
      "من با کمر تو در میان کردم دست",
      "پنداشتمش که در میان چیزی هست",
      "پیداست از آن میان چو بربست کمر",
      "تا من ز کمر چه طرْف خواهم بربست",
    ],
    poetId: 0,
  },
  {
    id: 5,
    couplets: [
      "تو بدری و خورشید تو را بنده شده‌ست",
      "تا بندهٔ تو شده‌ست تابنده شده‌ست",
      "زان روی که از شعاع نور رخ تو",
      "خورشید منیر و ماه تابنده شده‌ست",
    ],
    poetId: 0,
  },
  {
    id: 6,
    couplets: [
      "هر روز دلم به زیر باری دگر است",
      "در دیدهٔ من ز هجر خاری دگر است",
      "من جهد همی‌کنم قضا می‌گوید",
      "بیرون ز کفایت تو کاری دگر است",
    ],
    poetId: 0,
  },
  {
    id: 7,
    couplets: [
      "ماهم که رخش روشنی خور بگرفت",
      "گرد خط او چشمهٔ کوثر بگرفت",
      "دل‌ها همه در چاه زنخدان انداخت",
      "وآنگه سر چاه را به عنبر بگرفت",
    ],
    poetId: 0,
  },
  {
    id: 8,
    couplets: [
      "امشب ز غمت میان خون خواهم خفت",
      "وز بستر عافیت برون خواهم خفت",
      "باور نکنی خیال خود را بفرست",
      "تا دَرنگرد که بی‌ تو چون خواهم خفت",
    ],
    poetId: 0,
  },
  {
    id: 9,
    couplets: [
      "نی قصهٔ آن شمع چگل بتوان گفت",
      "نی حالِ دلِ سوخته‌دل بتوان گفت",
      "غم در دلِ تنگِ من از آن است که نیست",
      "یک دوست که با او غمِ دل بتوان گفت",
    ],
    poetId: 0,
  },
]
